package com.company;

//918=2 2 2 1 1 2 1 2 2 1
//1)Число ФиО: 2 - задано в коде
//2)ФиО 2 –объекты
//3)Задание цвета текста и заливки ФиО:2 – стандарт.элемент выбора цвета;
//4)Выбор запускаемого ФиО 1 – выпад. список назв.;;
//5)Задание начальной скорости ФиО: 1 – указанием в текст. поле;
//6)Способ выбора запущенного ФиО 2 – из текст.поля, где вводится номер ФиО;;
//7)Присвоение номера ФиО: 1 – авто;;
//8)Возможность смены номера ФиО из УО: 2 - да
//9)Регулировка скорости перемещения выбран-го ФиО: 2 – из выпадающего списка (пять скоростей);;
//10)Изменения размера окна отображения ФиО: 1 – нет;


public class Main {

    public static int count;
    public static final int max_count = 5;

    public static void main(String[] args) {
        count = 0;
        Figures figures = new Figures();
    }
}
